#######################################################
#       Установка AI Cashier System - начало          #
#######################################################

Проверяем opencv-python...
opencv-python уже установлен

Проверяем mediapipe...
mediapipe уже установлен

Проверяем numpy...
numpy уже установлен

Проверяем pyttsx3...
pyttsx3 уже установлен

Проверяем SpeechRecognition...
SpeechRecognition уже установлен

Проверяем PyQt5...
PyQt5 уже установлен

Проверяем ultralytics...
ultralytics уже установлен

Модель YOLOv8 уже загружена

Папка receipts уже существует

Папка logs уже существует

#######################################################
#       Проверка завершена!                           #
#                                                    #
# Все необходимые компоненты установлены и готовы     #
# к работе.                                          #
#                                                    #
# Для запуска системы выполните:                      #
#    python AI-cashier.py                            #
#                                                    #
# Чек автоматически сохраняются в папке receipts     #
#######################################################

Press any key to continue . . .